* Alec
** TODO implement Helm
** TODO fix find file
   possibly just implement a different shortcut to create a file, or just remove IDO from find file
   since we have Projectile for smart finding

** TODO fix magit performance issues during large merge conflict
** TODO strip out bare bones emacs config file for the office
** TODO implement more org-capture templates
** TODO fix auto complete
   only want to be able to opt in with tab etc
   so maybe prefer company over whatever else is trying to comlete (ivy?)

** TODO web mode sometimes just deactivates 
** TODO i3: remove focus on notifications
** TODO i3: fix positioning of notifications and konsole
** DONE find a way to stop company-mode from slowing doing shells or disable it with hooks
   CLOSED: [2020-03-10 Tue 00:36]

** TODO remove line numbers from comint and like text files
   files/buffers above certain size basically

** DONE swiper for currently selected text
   CLOSED: [2020-03-10 Tue 00:34]

** DONE swiper for word under cursor
   CLOSED: [2020-03-10 Tue 00:34]

** TODO GOTO file under cursor
   I believe find-file (C-x C-f) used to work for this

** TODO snippets
   especially for rails (template if statements etc)

** TODO look into emacs server again
   could be very useful to run profiler in the background

** TODO thing at point
   projectile ag search
   find file
   find dir
   etc

** TODO schedule issues (todos) for particular days
   probably already possible, but make it easy-> shortcut

** DONE change the prev-buffer and next-buffer shortcuts
   it's /C-x p/ or /C-x r/ now
   CLOSED: [2020-04-22 Wed 10:48]
   it's currently C-x left /or/ right
   gotta be something requiring less stretch
   
** TODO make issues relatable
   add "epic" style issues so that issues can link to other issues
   or be depend on other issues ("blocking")

** TODO handle scheduled events
   https://emacs.stackexchange.com/questions/22479/org-mode-automatically-clock-in-to-a-task-with-idle-timer/22488
   :LOGBOOK:
   CLOCK: [2020-04-29 Wed 01:32]--[2020-04-29 Wed 22:23] => 20:51
   CLOCK: [2020-04-29 Wed 01:28]--[2020-04-29 Wed 01:32] =>  0:04
   CLOCK: [2020-04-29 Wed 01:26]--[2020-04-29 Wed 01:27] =>  0:01
   CLOCK: [2020-04-29 Wed 01:16]--[2020-04-29 Wed 01:26] =>  0:10
   :END:
   
** TODO org mode stuff to check out
   https://github.com/ahungry/org-jira
   https://github.com/IvanMalison/org-projectile
   https://github.com/jethrokuan/org-roam

** TODO update doom-city-lights colour scheme
   replace some of the reds/pinks/oranges at the theme level instead of the way I'm doing it now
   
** TODO find a way to properly customize face, fonts, etc
** TODO make modules easier to include or exclude
   especially face - it should probably be an entirely empty file for newcomers

   maybe add a wizard for installation that asks about stuff like:
   ivy? (that probably includes company etc)
   capture?
   python?

   and also allows you to easily setup theme

** TODO fix robe so that it start automatically
   when entering a ruby project it should pick up the gemset (via RVM?) and environment for that project and start robe
   https://lorefnon.me/2014/02/02/configuring-emacs-for-rails.html

** TODO setting TODO on an item that doesn't have state should just default to TODO
   https://emacs.stackexchange.com/questions/57830/how-can-i-automatically-change-a-todo-agenda-item-task-to-progress-when-clocking
   or possibly "IN_PROGRESS"

** TODO find-file shortcut to just go to other window (if it exists) and open there else create one
** TODO navigate around windows
   https://sachachua.com/blog/2015/01/emacs-microhabit-switching-windows-windmove-ace-window-ace-jump/
   checkout ace window and ace jump, as well as keychord

   https://emacs.stackexchange.com/questions/3458/how-to-switch-between-windows-quickly

   https://emacs.stackexchange.com/questions/22286/shiftarrow-to-change-window-does-not-work-in-org-mode
   
** TODO setup refile like here
   http://doc.rix.si/cce/cce-org.html#org9971637

** TODO more great org configs
   https://github.com/gjstein/emacs.d/blob/master/config/init-10-face.el

** TODO symlink id-project.org to notes.org in project folder
   add the notes.org to git info exclude
   this is so that we can find notes easier, it also fixes the whole org capture problem for project
   specific issues
** TODO create and backup gpg keys
https://gpgtools.tenderapp.com/kb/gpg-keychain-faq/backup-or-transfer-your-keys#transfer-keys-to-another-computer
   https://tunjos.co/blog/backup-your-gpg-key/
** TODO setup tmux keys
   https://zserge.com/posts/tmux/
   https://tmuxguide.readthedocs.io/en/latest/tmux/tmux.html
** TODO ubuntu 20.04 upgrade
   https://github.com/efazati/i3buntu

** TODO renaming a file should autocomplete that files name
   I also used to be able to rename a file from within it

** TODO python breakpoints
   https://documen.tician.de/pudb/starting.html

** TODO link org to project management
   - [ ] Github projects
   - [ ] Jira

** TODO deal with repeated meetings when sprint is closed

** TODO get rid of "activity screens" shortcut that fucks up the i3 layout
** TODO setup the compose key configuration
   CapsLock -> ComposeKey allowing special characters

** TODO implement whatfiles
   https://github.com/spieglt/whatfiles

** TODO email
   http://www.mycpu.org/read-email-in-emacs/
   https://200ok.ch/posts/2020-05-27_using_emacs_and_mu4e_for_emails_even_with_html.html

** TODO i3 - open new window in specific size
   https://www.reddit.com/r/i3wm/comments/9j10ae/i3wm_open_window_in_specific_size/
   https://i3wm.org/docs/layout-saving.html

** TODO unix pipes
   https://prithu.xyz/posts/unix-pipeline/

** TODO uml
   https://plantuml.com/
   http://eschulte.github.io/babel-dev/DONE-integrate-plantuml-support.html

** TODO Zettelkasten
   https://eugeneyan.com/2020/04/05/note-taking-zettelkasten/
** TODO i3 terminal stuff
   https://www.youtube.com/watch?v=q-l7DnDbiiU
   Yakuake
   https://github.com/akermu/emacs-libvterm
   tmux

** TODO show i3 keyboard shortcuts
   https://www.reddit.com/r/i3wm/comments/gz2eyx/small_tool_i_made_to_visualize_your_i3_keybindings/
** TODO conky
   https://github.com/brndnmtthws/conky
** TODO dmenu vs rofi
** TODO Manjaro Jack setup 
   https://www.youtube.com/watch?v=vgrqMv3Lzfk
   https://forum.manjaro.org/t/how-to-replace-pulseaudio-with-jack-jack-and-pulseaudio-together-as-friend/2086
   https://kx.studio/Repositories
** TODO home drive mounted to second hard drive
   https://www.howtogeek.com/442101/how-to-move-your-linux-home-directory-to-another-hard-drive/
** TODO jumping around in code
   https://www.reddit.com/r/emacs/comments/h138pp/what_is_the_best_method_you_have_found_for/
** TODO polybar
   https://github.com/polybar/polybar
** TODO org mode css
   https://sandyuraz.com/articles/orgmode-css/
** TODO i3 font awesome icons and notification demon
   https://github.com/Algorithm79/Dotfiles_i3/


** TODO custom theme generator
   https://www.reddit.com/r/unixporn/comments/947y8t/ocemacs_a_doom_theme_generator/
   http://terminal.sexy/#Hh4ep6enHh4ez2pMj51q-e6YdYemm4Wdr8Tbp6enX1pgz2pMj51q-e6YdYemm4Wdr8Tb____
   https://github.com/hlissner/doom-emacs/issues/2732

* Andrew
** DONE timesheet slow
   CLOSED: [2020-03-10 Tue 00:50]
   org-mode was slowed down by linum-mode
   should be using display-line-numbers-mode instead
** DONE refresh buffer not working. used to be F6
   CLOSED: [2020-03-10 Tue 00:35]
** TODO setup emacs shell for ssh and docker
this also needs to work when you use django shell inside docker container inside server connection
** DONE overwrite mode not working
   CLOSED: [2020-04-23 Thu 12:12]
** FEEDBACK need to remap or learn macros
** TODO warnings about imports not being used, etc are missing
** FEEDBACK learn magit
** TODO add pretier for js
   https://github.com/prettier/prettier-emacs
** DONE ctrl . to take me to class or function
   CLOSED: [2020-04-23 Thu 12:12]
** TODO restclientmode


* Emacs productivity sessions
** Session 2 - Agenda
*** 
*** org capture
**** meetings, scheduled tasks and deadlines
     https://orgmode.org/manual/The-date_002ftime-prompt.html#The-date_002ftime-prompt
**** getting things set up
     symlink notes.org in your project folder to id-{project_name}.org
     put notes.org in your project's .git/info/exclude

     git config --global core.excludesfile 'notes.org'
*** ivy
**** ivy-occur
     ag search for something then:
     C-c C-o
     we can inline search and replace
     C-x C-q
     
*** M-y yank if you want to repeat cut+paste previous item
